#### Terraform Plan 📋
```
aws_s3_bucket.msp_storage: Refreshing state... [id=msp-storage-288761743095]
aws_instance.msp_02: Refreshing state... [id=i-0416cfd17698f83bd]
aws_security_group.msp_sg: Refreshing state... [id=sg-0be41ab65039bf8d6]
aws_s3_bucket_versioning.msp_storage: Refreshing state... [id=msp-storage-288761743095]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.msp_storage has been deleted
  - resource "aws_s3_bucket" "msp_storage" {
      - id                          = "msp-storage-288761743095" -> null
        tags                        = {
            "Name" = "msp-storage"
        }
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.msp_storage will be created
  + resource "aws_s3_bucket" "msp_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "msp-storage-288761743095"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "msp-storage"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "msp-storage"
          + "Project"     = "msp-infrastructure"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_versioning.msp_storage will be created
  + resource "aws_s3_bucket_versioning" "msp_storage" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - msp_02_instance_id = "i-0416cfd17698f83bd" -> null
  - msp_02_public_ip   = "44.200.9.66" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @imzouwei-lang*